#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
data.google_service_account.terraform_sa: Reading...
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
module.artifact_registry.google_artifact_registry_repository.repository: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/repositories/youtube-data-api-repository]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_iam_workload_identity_pool.mypool will be created
  + resource "google_iam_workload_identity_pool" "mypool" {
      + description               = "GitHub Actions で使用"
      + display_name              = "mypool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "youtube-data-api-385206"
      + state                     = (known after apply)
      + workload_identity_pool_id = "mypool"
    }

  # google_iam_workload_identity_pool_provider.myprovider will be created
  + resource "google_iam_workload_identity_pool_provider" "myprovider" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "GitHub Actions で使用"
      + display_name                       = "myprovider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "youtube-data-api-385206"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "mypool"
      + workload_identity_pool_provider_id = "myprovider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_project_iam_member.app[0] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.app[1] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.app[2] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/run.serviceAgent"
    }

  # google_project_iam_member.app[3] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/pubsub.publisher"
    }

  # google_project_iam_member.app[4] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/storage.objectCreator"
    }

  # google_project_iam_member.app[5] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.invoker will be created
  + resource "google_project_iam_member" "invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "youtube-data-api-385206"
      + role    = "roles/run.invoker"
    }

  # google_service_account.app will be created
  + resource "google_service_account" "app" {
      + account_id   = "youtube-data-api-sa"
      + disabled     = false
      + display_name = "Service Account for youtube-data-api"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "youtube-data-api-385206"
      + unique_id    = (known after apply)
    }

  # google_service_account.invoker will be created
  + resource "google_service_account" "invoker" {
      + account_id   = "cloudrun-invoker"
      + disabled     = false
      + display_name = "Cloud Run Invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "youtube-data-api-385206"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.terraform_sa will be created
  + resource "google_service_account_iam_member" "terraform_sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com"
    }

  # module.pubsub_subscription.google_pubsub_subscription.main will be created
  + resource "google_pubsub_subscription" "main" {
      + ack_deadline_seconds       = 599
      + effective_labels           = (known after apply)
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "1200s"
      + name                       = "youtube-data-api-sub"
      + project                    = "youtube-data-api-385206"
      + terraform_labels           = (known after apply)
      + topic                      = "google_pubsub_topic.main.name"

      + dead_letter_policy {
          + dead_letter_topic     = "google_pubsub_topic.main_dead_letter.id"
          + max_delivery_attempts = 5
        }

      + expiration_policy {
            # (1 unchanged attribute hidden)
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_policy {
          + maximum_backoff = (known after apply)
          + minimum_backoff = "10s"
        }
    }

  # module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role will be created
  + resource "google_pubsub_subscription_iam_member" "subscription_subscriber_role" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = (known after apply)
      + role         = "roles/pubsub.subscriber"
      + subscription = "youtube-data-api-sub"
    }

  # module.pubsub_topic.google_pubsub_topic.main will be created
  + resource "google_pubsub_topic" "main" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "youtube-data-api"
      + project          = "youtube-data-api-385206"
      + terraform_labels = (known after apply)
    }

  # module.pubsub_topic.google_pubsub_topic.main_dead_letter will be created
  + resource "google_pubsub_topic" "main_dead_letter" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "youtube-data-api-dlq"
      + project          = "youtube-data-api-385206"
      + terraform_labels = (known after apply)
    }

  # module.pubsub_topic.google_pubsub_topic_iam_member.topic_publisher_role will be created
  + resource "google_pubsub_topic_iam_member" "topic_publisher_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = "youtube-data-api"
    }

  # module.run.google_cloud_run_service_iam_member.api_invoker will be created
  + resource "google_cloud_run_service_iam_member" "api_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + project  = "youtube-data-api-385206"
      + role     = "roles/run.invoker"
      + service  = "youtube-data-api-api"
    }

  # module.run.google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_ONLY"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "youtube-data-api-api"
      + observed_generation     = (known after apply)
      + project                 = "youtube-data-api-385206"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/youtube-data-api-repository/youtube-data-api:"

              + env {
                  + name  = "GOOGLE_PROJECT_ID"
                  + value = "youtube-data-api-385206"
                }
              + env {
                  + name  = "PUBSUB_GENERATE_ANNOTATIONS_TOPIC"
                  + value = "google_pubsub_topic.main.name"
                }
              + env {
                  + name  = "CLOUD_STORAGE_BUCKET"
                  + value = "google_storage_bucket.bucket.name"
                }
              + env {
                  + name  = "YOUTUBE_API_SERVICE_NAME"
                  + value = "youtube"
                }
              + env {
                  + name  = "YOUTUBE_API_VERSION"
                  + value = "v3"
                }
              + env {
                  + name  = "SECRET_ID"
                  + value = "YOUTUBE_API_KEY"
                }
              + env {
                  + name  = "SECRET_YOUTUBE_API_VERSION"
                  + value = "1"
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "1000m"
                      + "memory" = "1Gi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 3
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.scheduler.google_cloud_scheduler_job.invoke-transfer will be created
  + resource "google_cloud_scheduler_job" "invoke-transfer" {
      + description = "suggesting your lunch"
      + id          = (known after apply)
      + name        = "invoke-transfer"
      + paused      = (known after apply)
      + project     = "youtube-data-api-385206"
      + region      = "asia-northeast1"
      + schedule    = "0 12 * * *"
      + state       = (known after apply)
      + time_zone   = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.storage.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "youtube-data-api-385206-youtube-data-api"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.storage.google_storage_bucket_iam_member.member will be created
  + resource "google_storage_bucket_iam_member" "member" {
      + bucket = "youtube-data-api-385206-youtube-data-api"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @Kamegrueon, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*